Autodesk.Revit.ApplicationServices.Application.GetCloudModelInformationFromModelPath(System.String,System.String,System.String,System.String)
Gets cloud model guid from project id, folder id and model name.
region:
The BIM 360 account and project region.
projectId:
Project identity in BIM 360.
folderId:
Folder identity in BIM 360.
modelName:
Model name in BIM 360.
Returns:
Returns cloud model information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.ApplicationServices.Application.OpenCloudSharedModel(System.String,System.Guid,System.Guid)
Opens a document from a cloud shared model
Remarks:
The resulting document is a local file attached to the central model in the cloud.
This method opens the document into memory but does not make it visible to the user in any way.
Internally calls openDocumentFile, so this method may throw any of the same exceptions.
region:
Account region of the model.
projectID:
The id of the project to which the model has been assigned.
modelID:
The id of the model.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.ApplicationServices.Application.SendAdpData(System.String,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.AddInId)
Send analytics data.
serializedData:
JSON serialized Facet::Core.
pDocument:
Pointer to ADocument, may be nullptr
pAddIn:
Pointer to AddInId, may be nullptr
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021.1

Autodesk.Revit.ApplicationServices.Application.CreateJournalHint(System.String,System.String)
Records a string in the journal file in the interactive session and fails on playback if recorded string is different.
stringToJournal:
The string to journal.
failureMessage:
The failure message.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ApplicationServices.Application.GetIniVarString(System.String,System.String)
Gets a setting from an ini file, as a string.
iniSection:
The section in the ini file where the setting is declared.
iniEntry:
The setting's name.
Returns:
The value of the setting or an empty string is no setting was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ApplicationServices.Application.IsFeatureEnabledInLaunchDarkly(System.String)
Determines if the specified feature is enabled in Launch Darkly.
strFeatureName:
The feature name you want to ask Launch Darkly about
Returns:
True if Launch Darkly flag is on
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.ApplicationServices.Application.SetSystemsAnalysisWorkflows(System.Collections.Generic.IDictionary{System.String,System.String})
Sets name and path information identifying systems analysis workflow files.
Remarks:
The map should be specified as a key that is the name of the systems analysis workflow,
and a value that is the path to the workflow file.
paths:
The map of systems analysis workflows.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.ApplicationServices.Application.RegisterFailuresProcessor(Autodesk.Revit.DB.IFailuresProcessor)
Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors
(including those not generated by your application) for the rest of the Revit session;
if your application is not prepared to respond to all warnings and errors,
consider use of IFailuresPreprocessor (in your opened Transaction)
or the FailuresProcessing event instead of this interface.
Remarks:
If there is previously registered Failures Processor, it gets discarded.
If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler
for all Revit errors for the session. The standard Revit error dialog will not appear.
processor:
Instance of Failures Processor to be used by the Revit Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.ApplicationServices.Application.SendAdpData(Autodesk.Revit.DB.AddInId,Autodesk.Revit.DB.Document,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, DB::AddInId and DB::Document to the Revit for processing and sending to the ADP data lake.
addInId: DB::AddInId addInId with data for collection
document: DB::Document document with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2021.1

Autodesk.Revit.ApplicationServices.Application.SendAdpData(Autodesk.Revit.DB.Document,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, and DB::Document to the Revit for processing and sending to the ADP data lake.
document: DB::Document addInId with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2021.1

Autodesk.Revit.ApplicationServices.Application.SendAdpData(Autodesk.Revit.DB.AddInId,Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data, and DB::AddInId to the Revit for processing and sending to the ADP data lake.
addInId: DB::AddInId addInId with data for collection
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2021.1

Autodesk.Revit.ApplicationServices.Application.SendAdpData(Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data to the Revit for processing and sending to the ADP data lake.
coreFacet: Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException: A non-optional argument was NULL
Since: 2021.1